<template>
  <div>
    <h1>тренажер</h1>
    <Typing :string="string" />

  </div>
</template>

<script>
import Typing from '@/views/components/trainer/Typing'

export default {
  name: 'Trainer',
  components: {
      Typing
  },
  data() {
      return {
          string: "Как принято считать, стремящиеся вытеснить традиционное производство, нанотехнологии, которые представляют собой яркий пример континентально-европейского типа политической культуры, будут функционально разнесены на независимые элементы! Но выбранный нами инновационный путь обеспечивает актуальность укрепления моральных ценностей. Имеется спорная точка зрения, гласящая примерно следующее: диаграммы связей превращены в посмешище, хотя само их существование приносит несомненную пользу обществу",
      }
  }
  
}



</script>

